InformationRegisters/УчетЗаработкаРаботников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>УчетЗаработкаРаботников</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпособОтраженияВУпрУчете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВУпрУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчетНачисленийПоОрганизации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/УчетРасходовНаПерсоналПереопределяемый/Ext/Module.bsl
Процедура ДополнитьДвиженияСведениямиДляУпрУчета(Движения, Выборка, ДатаНачала, ИмяПоляПодразделение = "Подразделение") Экспорт

	Если ИмяПоляПодразделение <> "" И ЗначениеЗаполнено(Выборка.СпособОтраженияВУпрУчете) И Выборка.УчетНачисленийПоОрганизации Тогда
                                                                        
		Движение = Движения.УчетЗаработкаРаботников.Добавить();
		// Свойства
		Движение.Период						 = ДатаНачала;
		// Измерения
		Движение.Физлицо					 = Выборка.Физлицо;
		// Ресурсы
		Движение.СпособОтраженияВУпрУчете	 = Выборка.СпособОтраженияВУпрУчете;
		Движение.УчетНачисленийПоОрганизации = Выборка.УчетНачисленийПоОрганизации;

	КонецЕсли;
	
КонецПроцедуры

#Если ТолстыйКлиентОбычноеПриложение Тогда

Процедура НастройкаПараметровУчетаПередОткрытиемФормы(ОбработкаНастройкаПараметровУчета, Форма) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Процедуры, функции для работы формы подразделения

Процедура ПередОткрытиемФормыПодразделенияДополнительно(Форма, ДополнительныеДействия) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено

КонецПроцедуры

Процедура ВыполнитьДополнительныеДействияФормыПодразделения(Элемент, Форма) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено

КонецПроцедуры

Процедура ОбработатьОповещениеФормыПодразделения(ИмяСобытия, Параметр, Источник, Форма) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Процедуры, функции для работы форм объектов, участвующих в учете расходов на персонал

Процедура ФормаВидаРасчетаУстановитьВидимостьДополнительно(Форма) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено

КонецПроцедуры

Процедура ПередОткрытиемФормыКадровогоДокументаДополнительно(Форма) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено

КонецПроцедуры

Процедура ФормаСценарияПланированияДополнительно(Форма) Экспорт
		
    // В этой конфигурации дополнительных действий не предусмотрено
	
КонецПроцедуры

#КонецЕсли
